#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.this: Refreshing state... [id=862f74fb15500f339e93ad23da95ba9a5a553751]
local_file.cloud_pem: Refreshing state... [id=0e456aaf02e792fc5c712f411881f4191acebb25]
module.key_pair.aws_key_pair.this[0]: Refreshing state... [id=test]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0cd38112092baf927]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-086eccf56685e69fc]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-03d35c71b78d91847]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-023359d7cc7d68417]
module.ssh_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0310ff5b57d86a8c8]
module.ec2_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-08d521124aac6c2fd]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-065353468516f98a4]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0d298b4fed68f244e]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-042e9a0f2623bc8dc]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-04605cf5436ef5f2b]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0023601f22181ef37]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0fbc42d0ba2f37902]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0f1d3bd404491c023]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0d7f4eb3f5aec425a]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-04531fbfe94596c82]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-010df001fe7c9cdc1]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-012fc94ef89a5e129]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-023359d7cc7d684171080289494]
module.ssh_sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1269737753]
module.ec2_sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-745001700]
module.ec2_sg.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-4109159301]
module.ec2_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-3870400889]
module.ec2_sg.aws_security_group_rule.ingress_rules[2]: Refreshing state... [id=sgrule-139027130]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0578d3de0de551d96]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-001ad1c8b4b32252a]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-02b9571cea3017dd7]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0b0e7639b806e4a58]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-04504342bd385f9a7]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d3adc74c04289fd3]
module.ec2_instance.aws_instance.this[0]: Refreshing state... [id=i-0aab56825624e9f8a]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # local_file.cloud_pem has been deleted
  - resource "local_file" "cloud_pem" {
      - content              = (sensitive) -> null
      - content_base64sha256 = "C0x1NhjIue10RHXmKbrEyKzsO0WOCPyfiWOvCOvqwnk=" -> null
      - content_base64sha512 = "hbzAsQmSRKJdw2QrA3H9SfzSFPq9Yvn/IPbL1bX/D/e/NS9m8n1yhZmCZuKQLN5tzdDULUF+p9HoFkgvSa3VVw==" -> null
      - content_md5          = "d90bbb8c5609f1452ffabf7d5275f898" -> null
      - content_sha1         = "0e456aaf02e792fc5c712f411881f4191acebb25" -> null
      - content_sha256       = "0b4c753618c8b9ed744475e629bac4c8acec3b458e08fc9f8963af08ebeac279" -> null
      - content_sha512       = "85bcc0b1099244a25dc3642b0371fd49fcd214fabd62f9ff20f6cbd5b5ff0ff7bf352f66f27d7285998266e2902cde6dcdd0d42d417ea7d1e816482f49add557" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0777" -> null
      - filename             = "./cloudtls.pem" -> null
      - id                   = "0e456aaf02e792fc5c712f411881f4191acebb25" -> null
    }

  # module.ec2_instance.aws_instance.this[0] has been deleted
  - resource "aws_instance" "this" {
      - ami                                  = "ami-04008951c9ded5b67" -> null
      - arn                                  = "arn:aws:ec2:ap-southeast-1:356077346614:instance/i-0aab56825624e9f8a" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "ap-southeast-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0aab56825624e9f8a" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "test" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-018e8b64635bd190d" -> null
      - private_dns                          = "ip-10-0-101-116.ap-southeast-1.compute.internal" -> null
      - private_ip                           = "10.0.101.116" -> null
      - public_dns                           = "ec2-3-0-94-106.ap-southeast-1.compute.amazonaws.com" -> null
      - public_ip                            = "3.0.94.106" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0fbc42d0ba2f37902" -> null
      - tags                                 = {
          - "Environment" = "dev"
          - "Name"        = "test-instance"
          - "Terraform"   = "true"
        } -> null
      - tags_all                             = {
          - "Environment" = "dev"
          - "Name"        = "test-instance"
          - "Terraform"   = "true"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "ffe819188479f86bbc6242b6675d080da8506da5" -> null
      - user_data_replace_on_change          = false -> null
      - volume_tags                          = {
          - "Name" = "test-instance"
        } -> null
      - vpc_security_group_ids               = [
          - "sg-0310ff5b57d86a8c8",
          - "sg-08d521124aac6c2fd",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0967ec93f3bacafc9" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }

      - timeouts {}
    }

  # module.ec2_sg.aws_security_group.this_name_prefix[0] has been deleted
  - resource "aws_security_group" "this_name_prefix" {
      - arn                    = "arn:aws:ec2:ap-southeast-1:356077346614:security-group/sg-08d521124aac6c2fd" -> null
      - description            = "Security group for ec2_sg" -> null
      - egress                 = [] -> null
      - id                     = "sg-08d521124aac6c2fd" -> null
      - ingress                = [] -> null
      - name                   = "ec2_sg-20230510135343664300000001" -> null
      - name_prefix            = "ec2_sg-" -> null
      - owner_id               = "356077346614" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "ec2_sg"
        } -> null
      - tags_all               = {
          - "Name" = "ec2_sg"
        } -> null
      - vpc_id                 = "vpc-0cd38112092baf927" -> null

      - timeouts {
          - create = "10m" -> null
          - delete = "15m" -> null
        }
    }

  # module.ec2_sg.aws_security_group_rule.egress_rules[0] has been deleted
  - resource "aws_security_group_rule" "egress_rules" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "All protocols" -> null
      - from_port         = -1 -> null
      - id                = "sgrule-3870400889" -> null
      - ipv6_cidr_blocks  = [
          - "::/0",
        ] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-08d521124aac6c2fd" -> null
      - self              = false -> null
      - to_port           = -1 -> null
      - type              = "egress" -> null
    }

  # module.ec2_sg.aws_security_group_rule.ingress_rules[0] has been deleted
  - resource "aws_security_group_rule" "ingress_rules" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "HTTP" -> null
      - from_port              = 80 -> null
      - id                     = "sgrule-745001700" -> null
      - ipv6_cidr_blocks       = [] -> null
      - prefix_list_ids        = [] -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-08d521124aac6c2fd" -> null
      - security_group_rule_id = "sgr-0cc740e707555e5fe" -> null
      - self                   = false -> null
      - to_port                = 80 -> null
      - type                   = "ingress" -> null
    }

  # module.ec2_sg.aws_security_group_rule.ingress_rules[1] has been deleted
  - resource "aws_security_group_rule" "ingress_rules" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "HTTPS" -> null
      - from_port              = 443 -> null
      - id                     = "sgrule-4109159301" -> null
      - ipv6_cidr_blocks       = [] -> null
      - prefix_list_ids        = [] -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-08d521124aac6c2fd" -> null
      - security_group_rule_id = "sgr-0c02e96a34ea51877" -> null
      - self                   = false -> null
      - to_port                = 443 -> null
      - type                   = "ingress" -> null
    }

  # module.ec2_sg.aws_security_group_rule.ingress_rules[2] has been deleted
  - resource "aws_security_group_rule" "ingress_rules" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "All IPV4 ICMP" -> null
      - from_port              = -1 -> null
      - id                     = "sgrule-139027130" -> null
      - ipv6_cidr_blocks       = [] -> null
      - prefix_list_ids        = [] -> null
      - protocol               = "icmp" -> null
      - security_group_id      = "sg-08d521124aac6c2fd" -> null
      - security_group_rule_id = "sgr-0e682e3c06f9bbc87" -> null
      - self                   = false -> null
      - to_port                = -1 -> null
      - type                   = "ingress" -> null
    }

  # module.key_pair.aws_key_pair.this[0] has been deleted
  - resource "aws_key_pair" "this" {
      - arn         = "arn:aws:ec2:ap-southeast-1:356077346614:key-pair/test" -> null
      - fingerprint = "35:cb:48:dd:1b:14:a2:47:1e:c9:77:e8:d3:b7:f8:e7" -> null
      - id          = "test" -> null
      - key_name    = "test" -> null
      - key_pair_id = "key-064854fc5276c68c6" -> null
      - key_type    = "rsa" -> null
      - public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDSeoZip6sXNFAxmE5dfzS+bOlTJIyZZdGCzNkROBEueJ9zKtf1wad6xCCysZ3yMXWLP1uJ+NO82n5ERH6SQzMGo4JCdsOKUQG0N4uSTfYnJPSnjn+O6x4aVsNb5bIa/AYBKauk+rSz83bzQerolCws9XMG2ZjFExcw7aNZ1mmcLO9hS1g4Zhhb7qrUnOgl+ioNZ/yRmEeqsz39Bpg/zuDN4x0Hd03VLH/i/iMsdj/eugnakBO4TZ+4ANoVEZ9P47TaTaJ7CSyFiw72YLSiTRho14UotISbeide2XTBu5CjTTVs/ovjX6wcKSJgLZrrxa/xff4j+BdMr9QPEEQZFVMkSqZAfd7k5LeAJTfRFdBuUllL+RB24zgfhqm5ed+EuOXVjQe8uu7/UKIlaWkeU97RGRTFBek8NtmmeYSn7blnKGYuXaN+u/yIrJSrlVXb9YsEnWoIqdz3I4+vVzDSGBm5gvBvQDifp49ZcrewEWG+5eo7a10l1CnUtpQ98rcMj8IuyYqBXXldlxuSOFdcNFrWX30jGvlEK7tGtKFNXakzI6wa3/mTxmL8Fe11cQbN/FfOzeV2nCRFYn0LKvyQ0lsLZ6PLIbs1f9YmPwndlCGhCdw8oJscmw/bvZX+3ZsocOhffsaqtDAeBxkIsqFicjMB10Yx/YxndbVzrIkqvz0aTw==" -> null
      - tags_all    = {} -> null
    }

  # module.ssh_sg.aws_security_group.this_name_prefix[0] has been deleted
  - resource "aws_security_group" "this_name_prefix" {
      - arn                    = "arn:aws:ec2:ap-southeast-1:356077346614:security-group/sg-0310ff5b57d86a8c8" -> null
      - description            = "Security group for ec2_sg" -> null
      - egress                 = [] -> null
      - id                     = "sg-0310ff5b57d86a8c8" -> null
      - ingress                = [] -> null
      - name                   = "ssh_sg-20230510135346715600000002" -> null
      - name_prefix            = "ssh_sg-" -> null
      - owner_id               = "356077346614" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "ssh_sg"
        } -> null
      - tags_all               = {
          - "Name" = "ssh_sg"
        } -> null
      - vpc_id                 = "vpc-0cd38112092baf927" -> null

      - timeouts {
          - create = "10m" -> null
          - delete = "15m" -> null
        }
    }

  # module.ssh_sg.aws_security_group_rule.ingress_rules[0] has been deleted
  - resource "aws_security_group_rule" "ingress_rules" {
      - cidr_blocks            = [
          - "52.74.146.55/32",
        ] -> null
      - description            = "SSH" -> null
      - from_port              = 22 -> null
      - id                     = "sgrule-1269737753" -> null
      - ipv6_cidr_blocks       = [] -> null
      - prefix_list_ids        = [] -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-0310ff5b57d86a8c8" -> null
      - security_group_rule_id = "sgr-068e1bc06d7d1c6e1" -> null
      - self                   = false -> null
      - to_port                = 22 -> null
      - type                   = "ingress" -> null
    }

  # module.vpc.aws_default_network_acl.this[0] has been deleted
  - resource "aws_default_network_acl" "this" {
      - arn                    = "arn:aws:ec2:ap-southeast-1:356077346614:network-acl/acl-065353468516f98a4" -> null
      - default_network_acl_id = "acl-065353468516f98a4" -> null
      - id                     = "acl-065353468516f98a4" -> null
      - owner_id               = "356077346614" -> null
      - subnet_ids             = [
          - "subnet-010df001fe7c9cdc1",
          - "subnet-012fc94ef89a5e129",
          - "subnet-04531fbfe94596c82",
          - "subnet-0d7f4eb3f5aec425a",
          - "subnet-0f1d3bd404491c023",
          - "subnet-0fbc42d0ba2f37902",
        ] -> null
      - tags                   = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-default"
          - "Terraform"   = "true"
        } -> null
      - tags_all               = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-default"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                 = "vpc-0cd38112092baf927" -> null

      - egress {
          - action          = "allow" -> null
          - from_port       = 0 -> null
          - ipv6_cidr_block = "::/0" -> null
          - protocol        = "-1" -> null
          - rule_no         = 101 -> null
          - to_port         = 0 -> null
        }
      - egress {
          - action     = "allow" -> null
          - cidr_block = "0.0.0.0/0" -> null
          - from_port  = 0 -> null
          - protocol   = "-1" -> null
          - rule_no    = 100 -> null
          - to_port    = 0 -> null
        }

      - ingress {
          - action          = "allow" -> null
          - from_port       = 0 -> null
          - ipv6_cidr_block = "::/0" -> null
          - protocol        = "-1" -> null
          - rule_no         = 101 -> null
          - to_port         = 0 -> null
        }
      - ingress {
          - action     = "allow" -> null
          - cidr_block = "0.0.0.0/0" -> null
          - from_port  = 0 -> null
          - protocol   = "-1" -> null
          - rule_no    = 100 -> null
          - to_port    = 0 -> null
        }
    }

  # module.vpc.aws_default_route_table.default[0] has been deleted
  - resource "aws_default_route_table" "default" {
      - arn                    = "arn:aws:ec2:ap-southeast-1:356077346614:route-table/rtb-03d35c71b78d91847" -> null
      - default_route_table_id = "rtb-03d35c71b78d91847" -> null
      - id                     = "rtb-03d35c71b78d91847" -> null
      - owner_id               = "356077346614" -> null
      - route                  = [] -> null
      - tags                   = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-default"
          - "Terraform"   = "true"
        } -> null
      - tags_all               = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-default"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                 = "vpc-0cd38112092baf927" -> null

      - timeouts {
          - create = "5m" -> null
          - update = "5m" -> null
        }
    }

  # module.vpc.aws_default_security_group.this[0] has been deleted
  - resource "aws_default_security_group" "this" {
      - arn                    = "arn:aws:ec2:ap-southeast-1:356077346614:security-group/sg-086eccf56685e69fc" -> null
      - description            = "default VPC security group" -> null
      - egress                 = [] -> null
      - id                     = "sg-086eccf56685e69fc" -> null
      - ingress                = [] -> null
      - name                   = "default" -> null
      - owner_id               = "356077346614" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-default"
          - "Terraform"   = "true"
        } -> null
      - tags_all               = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-default"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                 = "vpc-0cd38112092baf927" -> null
    }

  # module.vpc.aws_internet_gateway.this[0] has been deleted
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:ap-southeast-1:356077346614:internet-gateway/igw-0d298b4fed68f244e" -> null
      - id       = "igw-0d298b4fed68f244e" -> null
      - owner_id = "356077346614" -> null
      - tags     = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc"
          - "Terraform"   = "true"
        } -> null
      - tags_all = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc"
          - "Terraform"   = "true"
        } -> null
      - vpc_id   = "vpc-0cd38112092baf927" -> null
    }

  # module.vpc.aws_route.public_internet_gateway[0] has been deleted
  - resource "aws_route" "public_internet_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - gateway_id             = "igw-0d298b4fed68f244e" -> null
      - id                     = "r-rtb-023359d7cc7d684171080289494" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-023359d7cc7d68417" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.aws_route_table.private[0] has been deleted
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:ap-southeast-1:356077346614:route-table/rtb-042e9a0f2623bc8dc" -> null
      - id               = "rtb-042e9a0f2623bc8dc" -> null
      - owner_id         = "356077346614" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-ap-southeast-1a"
          - "Terraform"   = "true"
        } -> null
      - tags_all         = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-ap-southeast-1a"
          - "Terraform"   = "true"
        } -> null
      - vpc_id           = "vpc-0cd38112092baf927" -> null
    }

  # module.vpc.aws_route_table.private[1] has been deleted
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:ap-southeast-1:356077346614:route-table/rtb-0023601f22181ef37" -> null
      - id               = "rtb-0023601f22181ef37" -> null
      - owner_id         = "356077346614" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-ap-southeast-1b"
          - "Terraform"   = "true"
        } -> null
      - tags_all         = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-ap-southeast-1b"
          - "Terraform"   = "true"
        } -> null
      - vpc_id           = "vpc-0cd38112092baf927" -> null
    }

  # module.vpc.aws_route_table.private[2] has been deleted
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:ap-southeast-1:356077346614:route-table/rtb-04605cf5436ef5f2b" -> null
      - id               = "rtb-04605cf5436ef5f2b" -> null
      - owner_id         = "356077346614" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-ap-southeast-1c"
          - "Terraform"   = "true"
        } -> null
      - tags_all         = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-ap-southeast-1c"
          - "Terraform"   = "true"
        } -> null
      - vpc_id           = "vpc-0cd38112092baf927" -> null
    }

  # module.vpc.aws_route_table.public[0] has been deleted
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:ap-southeast-1:356077346614:route-table/rtb-023359d7cc7d68417" -> null
      - id               = "rtb-023359d7cc7d68417" -> null
      - owner_id         = "356077346614" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-public"
          - "Terraform"   = "true"
        } -> null
      - tags_all         = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-public"
          - "Terraform"   = "true"
        } -> null
      - vpc_id           = "vpc-0cd38112092baf927" -> null
    }

  # module.vpc.aws_route_table_association.private[0] has been deleted
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-0d3adc74c04289fd3" -> null
      - route_table_id = "rtb-042e9a0f2623bc8dc" -> null
      - subnet_id      = "subnet-012fc94ef89a5e129" -> null
    }

  # module.vpc.aws_route_table_association.private[1] has been deleted
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-0b0e7639b806e4a58" -> null
      - route_table_id = "rtb-0023601f22181ef37" -> null
      - subnet_id      = "subnet-04531fbfe94596c82" -> null
    }

  # module.vpc.aws_route_table_association.private[2] has been deleted
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-04504342bd385f9a7" -> null
      - route_table_id = "rtb-04605cf5436ef5f2b" -> null
      - subnet_id      = "subnet-010df001fe7c9cdc1" -> null
    }

  # module.vpc.aws_route_table_association.public[0] has been deleted
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0578d3de0de551d96" -> null
      - route_table_id = "rtb-023359d7cc7d68417" -> null
      - subnet_id      = "subnet-0fbc42d0ba2f37902" -> null
    }

  # module.vpc.aws_route_table_association.public[1] has been deleted
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-001ad1c8b4b32252a" -> null
      - route_table_id = "rtb-023359d7cc7d68417" -> null
      - subnet_id      = "subnet-0f1d3bd404491c023" -> null
    }

  # module.vpc.aws_route_table_association.public[2] has been deleted
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-02b9571cea3017dd7" -> null
      - route_table_id = "rtb-023359d7cc7d68417" -> null
      - subnet_id      = "subnet-0d7f4eb3f5aec425a" -> null
    }

  # module.vpc.aws_subnet.private[0] has been deleted
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:356077346614:subnet/subnet-012fc94ef89a5e129" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1a" -> null
      - availability_zone_id                           = "apse1-az1" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-012fc94ef89a5e129" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "356077346614" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-ap-southeast-1a"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-ap-southeast-1a"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-0cd38112092baf927" -> null
    }

  # module.vpc.aws_subnet.private[1] has been deleted
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:356077346614:subnet/subnet-04531fbfe94596c82" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1b" -> null
      - availability_zone_id                           = "apse1-az2" -> null
      - cidr_block                                     = "10.0.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-04531fbfe94596c82" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "356077346614" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-ap-southeast-1b"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-ap-southeast-1b"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-0cd38112092baf927" -> null
    }

  # module.vpc.aws_subnet.private[2] has been deleted
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:356077346614:subnet/subnet-010df001fe7c9cdc1" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1c" -> null
      - availability_zone_id                           = "apse1-az3" -> null
      - cidr_block                                     = "10.0.3.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-010df001fe7c9cdc1" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "356077346614" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-ap-southeast-1c"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-ap-southeast-1c"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-0cd38112092baf927" -> null
    }

  # module.vpc.aws_subnet.public[0] has been deleted
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:356077346614:subnet/subnet-0fbc42d0ba2f37902" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1a" -> null
      - availability_zone_id                           = "apse1-az1" -> null
      - cidr_block                                     = "10.0.101.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0fbc42d0ba2f37902" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "356077346614" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-public-ap-southeast-1a"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-public-ap-southeast-1a"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-0cd38112092baf927" -> null
    }

  # module.vpc.aws_subnet.public[1] has been deleted
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:356077346614:subnet/subnet-0f1d3bd404491c023" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1b" -> null
      - availability_zone_id                           = "apse1-az2" -> null
      - cidr_block                                     = "10.0.102.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0f1d3bd404491c023" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "356077346614" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-public-ap-southeast-1b"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-public-ap-southeast-1b"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-0cd38112092baf927" -> null
    }

  # module.vpc.aws_subnet.public[2] has been deleted
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:356077346614:subnet/subnet-0d7f4eb3f5aec425a" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1c" -> null
      - availability_zone_id                           = "apse1-az3" -> null
      - cidr_block                                     = "10.0.103.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0d7f4eb3f5aec425a" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "356077346614" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-public-ap-southeast-1c"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-public-ap-southeast-1c"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-0cd38112092baf927" -> null
    }

  # module.vpc.aws_vpc.this[0] has been deleted
  - resource "aws_vpc" "this" {
      - arn                                  = "arn:aws:ec2:ap-southeast-1:356077346614:vpc/vpc-0cd38112092baf927" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-065353468516f98a4" -> null
      - default_route_table_id               = "rtb-03d35c71b78d91847" -> null
      - default_security_group_id            = "sg-086eccf56685e69fc" -> null
      - dhcp_options_id                      = "dopt-071c2734dee8b8cb2" -> null
      - enable_classiclink                   = false -> null
      - enable_classiclink_dns_support       = false -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-0cd38112092baf927" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-03d35c71b78d91847" -> null
      - owner_id                             = "356077346614" -> null
      - tags                                 = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc"
          - "Terraform"   = "true"
        } -> null
      - tags_all                             = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc"
          - "Terraform"   = "true"
        } -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.cloud_pem will be created
  + resource "local_file" "cloud_pem" {
      + content              = (sensitive)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./cloudtls.pem"
      + id                   = (known after apply)
    }

  # module.ec2_instance.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0ba98499caf94125a"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "ap-southeast-1a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "test"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "test-instance"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "test-instance"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "ffe819188479f86bbc6242b6675d080da8506da5"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "test-instance"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

  # module.ec2_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group for ec2_sg"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ec2_sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ec2_sg"
        }
      + tags_all               = {
          + "Name" = "ec2_sg"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.ec2_sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.ec2_sg.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.ec2_sg.aws_security_group_rule.ingress_rules[1] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.ec2_sg.aws_security_group_rule.ingress_rules[2] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All IPV4 ICMP"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "icmp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "ingress"
    }

  # module.key_pair.aws_key_pair.this[0] will be created
  + resource "aws_key_pair" "this" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "test"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDSeoZip6sXNFAxmE5dfzS+bOlTJIyZZdGCzNkROBEueJ9zKtf1wad6xCCysZ3yMXWLP1uJ+NO82n5ERH6SQzMGo4JCdsOKUQG0N4uSTfYnJPSnjn+O6x4aVsNb5bIa/AYBKauk+rSz83bzQerolCws9XMG2ZjFExcw7aNZ1mmcLO9hS1g4Zhhb7qrUnOgl+ioNZ/yRmEeqsz39Bpg/zuDN4x0Hd03VLH/i/iMsdj/eugnakBO4TZ+4ANoVEZ9P47TaTaJ7CSyFiw72YLSiTRho14UotISbeide2XTBu5CjTTVs/ovjX6wcKSJgLZrrxa/xff4j+BdMr9QPEEQZFVMkSqZAfd7k5LeAJTfRFdBuUllL+RB24zgfhqm5ed+EuOXVjQe8uu7/UKIlaWkeU97RGRTFBek8NtmmeYSn7blnKGYuXaN+u/yIrJSrlVXb9YsEnWoIqdz3I4+vVzDSGBm5gvBvQDifp49ZcrewEWG+5eo7a10l1CnUtpQ98rcMj8IuyYqBXXldlxuSOFdcNFrWX30jGvlEK7tGtKFNXakzI6wa3/mTxmL8Fe11cQbN/FfOzeV2nCRFYn0LKvyQ0lsLZ6PLIbs1f9YmPwndlCGhCdw8oJscmw/bvZX+3ZsocOhffsaqtDAeBxkIsqFicjMB10Yx/YxndbVzrIkqvz0aTw=="
      + tags_all        = (known after apply)
    }

  # module.ssh_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group for ec2_sg"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ssh_sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ssh_sg"
        }
      + tags_all               = {
          + "Name" = "ssh_sg"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.ssh_sg.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "52.74.146.55/32",
        ]
      + description              = "SSH"
      + from_port                = 22
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-default"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-default"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-default"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-default"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-default"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-default"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc"
          + "Terraform"   = "true"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc"
          + "Terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-private-ap-southeast-1a"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-private-ap-southeast-1a"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-private-ap-southeast-1b"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-private-ap-southeast-1b"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-private-ap-southeast-1c"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-private-ap-southeast-1c"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-public"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-public"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-private-ap-southeast-1a"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-private-ap-southeast-1a"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-private-ap-southeast-1b"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-private-ap-southeast-1b"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-private-ap-southeast-1c"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-private-ap-southeast-1c"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-public-ap-southeast-1a"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-public-ap-southeast-1a"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-public-ap-southeast-1b"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-public-ap-southeast-1b"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-public-ap-southeast-1c"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc-public-ap-southeast-1c"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "my-vpc"
          + "Terraform"   = "true"
        }
    }

Plan: 32 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ ec2_public_ip = "3.0.94.106" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @thienchuong, Action: `pull_request`, Workflow: `deploy nonprod`*